[
    {
        "attack_steps": [
            {
                "name": "Create or Modify System Process: Windows Service as used by the malware",
                "truth": "Goofy Guineapig maintains persistence as a Windows service."
            }
        ]
    },
    {
        "attack_steps": [
            {
                "name": "Masquerading: Match Legitimate Name or Location as used by the malware",
                "truth": "Goofy Guineapig masquerades as a FireFox installer and a Google updater. Goofy Guineapig has trojanised a legitimate FireFox NSIS installation package and is dropped alongside legitimate FireFox files."
            },
            {
                "name": "Virtualization/Sandbox Evasion: Time Based Evasion as used by the malware",
                "truth": "On start up the Goofy Guineapig malware reads the CPU timestamp counter, saves the result, then reads the timestamp counter again immediately and saves the result. These two values are compared, and if the value is more than 100ms difference the malware will not continue execution."
            },
            {
                "name": "Virtualization/Sandbox Evasion: System Checks as used by the malware",
                "truth": "The malware implements some basic anti-sandbox / anti-virtual machine (VM) techniques. These include checking that the physical memory size of the machine exceeds 2GB and that the disk is more than 1GB in size. It also checks that the number of logical processors exceeds 2. If any of these checks fail the malware will exit. Variations on each of these sandbox detection checks were also observed during analysis of the Jolly Jellyfish malware."
            },
            {
                "name": "Virtualization/Sandbox Evasion: User Activity Based Checks as used by the malware",
                "truth": "Goofy Guineapig checks for processes running on a system which indicate that it is being reverse engineered or debugged and will not continue execution if any of the checks fail."
            },
            {
                "name": "Obfuscated Files or Information: Software Packing as used by the malware",
                "truth": "Goofy Guineapig is UPX packed and packaged in with a legitimate NSIS installer."
            },
            {
                "name": "Deobfuscate/Decode Files or Information as used by the malware",
                "truth": "Goofy Guineapig contains stack-based strings which are obfuscated with single byte XOR or subtraction throughout the binary."
            },
            {
                "name": "Hide Artifacts: Hidden Window as used by the malware",
                "truth": "Goofy Guineapig contains the functionality to perform process hollowing on dllhost.exe, when this is performed the process is created hidden."
            },
            {
                "name": "Indicator Removal on Host: File Deletion as used by the malware",
                "truth": "Once the persistence mechanism has been installed, the malicious files are copied to the ProgramData directory and removed from the directory containing the extracted Firefox files. The final command in the temp.bat script contains a command to self-delete."
            },
            {
                "name": "Hijack Execution Flow: DLL Side-Loading as used by the malware",
                "truth": "A legitimate executable is installed by the Goofy Guineapig loader, alongside a malicious DLL which will be loaded by the legitimate executable. The malicious DLL is sideloaded by the legitimate, signed, executable GoogleUpdate.exe (also dropped as part of the NSIS installer)."
            },
            {
                "name": "Process Injection: Process Hollowing as used by the malware",
                "truth": "The tasking has the option to perform process hollowing on the dllhost.exe process, allowing a payload executable to appear to run under a legitimate process path and name in process listings, injecting content downloaded by the C2"
            },
            {
                "name": "Signed Binary Proxy Execution: Rundll32 as used by the malware",
                "truth": "The Goofy Guineapig persistence mechanism utilises rundll32.exe and url.dll to execute the legitimate binary which will load the malicious DLL"
            }
        ]
    },
    {
        "attack_steps": [
            {
                "name": "System Information Discovery as used by the malware",
                "truth": "Goofy Guineapig sends information about the infected machine in each C2 packet, as an obfuscated ‘Authorization’ string in the HTTP header."
            }
        ]
    },
    {
        "attack_steps": [
            {
                "name": "Application Layer Protocol: Web Protocols as used by the malware",
                "truth": "C2 communications occur using HTTPS GET and POST requests."
            },
            {
                "name": "Fallback Channels as used by the malware",
                "truth": "Goofy Guineapig contains the functionality to communicate using UDP and the KCP protocol, or direct socket communications, dependant on an embedded configuration string."
            },
            {
                "name": "Non-Standard Port as used by the malware",
                "truth": "Goofy Guineapig communicates over the non-standard HTTPS port 4443."
            }
        ]
    }
]